#Визначник не змінюється під час транспонування матриці.
import numpy as np
A = np.array(
    [[4, -5, 7],
     [1, -4, 9],
     [-4, 0, 5],
     ]
    )
At = np.transpose(A)
print("Початкова матриця A:")
print(A)
print(f"Визначник базової матриці А: {int(np.linalg.det(A))}")
print("Транспонована матриця At:")
print(At)
print(f"Визначник транспонованої матриці At: {int(np.linalg.det(At))}")

# Якщо матриця містить рядок, що складається з нулів, її визначник дорівнює нулю.
import numpy as np
A = np.array(
    [[2, 7, 1, 2],
     [6, 1, 3, -1],
     [0, 0, 0, 0],
     [2, 9, 5, -1],
     ]
    )
print(f"Визначник матриці А: {int(np.linalg.det(A))}")

#Якщо в матриці поміняти місцями якісь два рядки, то її визначник змінить знак на протилежний.
import numpy as np
A = np.array(
    [[1, 0, -1],
     [11, 4, 7],
     [-6, 0, 0],
     ]
    )
B = np.array(
    [[11, 4, 7],
     [1, 0, -1],
     [-6, 0, 0],
     ]
    )
print(f"Визначник матриці А: {int(np.linalg.det(A))}")
print(f"Визначник матриці B: {int(np.linalg.det(B))}")

#Якщо матриця має два однакові рядки, то її визначник дорівнює нулю.
import numpy as np
A = np.array(
    [[2, 7, 1, 2],
     [6, 1, 3, -1],
     [2, 7, 1, 2],
     [2, 9, 5, -1],
     ]
    )
print(f"Визначник матриці А: {int(np.linalg.det(A))}")

#При множенні рядка матриці на число її визначник множиться на це число.
import numpy as np
A = np.array(
    [[2, 4, -12],
     [10, 3, 0],
     [1, -1, 1],
     ]
    )
B = np.array(
    [[1, 2, -6],
     [10, 3, 0],
     [1, -1, 1],
     ]
    )
print(f"Визначник матриці А: {int(np.linalg.det(A))}")
print(f"Визначник матриці B: {int(np.linalg.det(B))}")

#Якщо всі елементи i-го рядка матриці представлені у вигляді суми двох доданків Aij = Bj + Cj, то її визначник дорівнює сумі визначників двох матриць, у яких усі рядки, крім 
# i-го, такі самі, як і в заданій матриці А, а i-ий рядок:
# першої матриці складається з елементів Bj
# другої — складається з елементів Cj
import numpy as np
A = np.array(
    [[6, 4, 12],
     [10, 3, 0],
     [1, -1, 1],
     ]
    )
# [6,4,12] = [2+4,3+1,9+3]
B = np.array(
    [[2, 3, 9],
     [10, 3, 0],
     [1, -1, 1],
     ]
    )
C = np.array(
    [[4, 1, 3],
     [10, 3, 0],
     [1, -1, 1],
     ]
    )
print(f"Визначник матриці А: {round(np.linalg.det(A))}")
print(f"Визначник матриці B: {round(np.linalg.det(B))}")
print(f"Визначник матриці C: {round(np.linalg.det(C))}")

#Якщо один із рядків матриці є лінійною комбінацією інших рядків цієї матриці, то її визначник дорівнює нулю.
# Цей визначник дорівнює нулю, тому що третій рядок є сумою першого рядка та другого рядка, помноженого на 2.
import numpy as np
A = np.array(
    [[2, 7, -1],
     [0, 1, 3],
     [2, 9, 5],
     ]
    )
print(f"Визначник матриці А: {round(np.linalg.det(A))}")

#Якщо до елементів рядка (стовпця) визначника додати відповідні елементи іншого рядка (стовпця), помножені на будь-яке число, то визначник не зміниться.
import numpy as np
A = np.array(
    [[3, 8, 0],
     [1, 1, 1],
     [2, 9, 5],
     ]
    )
# Зміни: новий рядок 1 = рядок 1 - рядок 2
B = np.array(
    [[2, 7, -1],
     [1, 1, 1],
     [2, 9, 5],
     ]
    )
print(f"Визначник матриці А: {round(np.linalg.det(A))}")
print(f"Визначник матриці B: {round(np.linalg.det(B))}")

