# Типи Матриць 
# Завдання для самостiйної роботи

#Які з описаних нище матриць: 
# Є квадратними? - B, D - H
# Є діагональними? E - H
# Є трикутними? G, H
# В яких заповнена лише головна діагональ? - E
# В яких заповнена лише побічна діагональ? - F

import numpy as np
A = np.array([[1,5,3],[5,1,2]])
print(A)

print("------------------")

B = np.array([[1,2],[3,4]])
print(B)

print("------------------")

C = np.array([[1,2,2,2],[3,4,4,4]])
print(C)

print("------------------")

D = np.array([[1,1,1,1],[1,1,1,1],[1,1,1,1],[1,1,1,1]])
print(D)

print("------------------")

E = np.array([[3,1,1,1],[1,3,1,1],[1,1,3,1],[1,1,1,3]])
print(E)

print("------------------")

F = np.array([[1,1,1,5],[1,1,5,1],[1,5,1,1],[5,1,1,1]])
print(F)

print("------------------")

G = np.array([[4,1,1,5],[0,4,5,1],[0,0,4,1],[0,0,0,4]])
print(G)

print("------------------")

H = np.array([[4,0,0,0],[4,4,0,0],[2,7,4,0],[1,-3,9,4]])
print(H)

print("------------------")